import React from 'react';
import {
  Box,
  Heading,
  Stack,
  Text,
  Center,
  Accordion,
  AccordionItem,
  AccordionButton,
  AccordionPanel,
} from '@chakra-ui/react';
import { AddIcon, MinusIcon } from '@chakra-ui/icons';
import { helpBackground } from '../../images';

const faqsStudent = [
  {
    header: 'Какви уроци се предлагат на платформата?',
    text: `На нашата платформа се предлагат както групови курсове, така и частни уроци 1:1. Груповите курсове позволяват на учениците да се включат в интерактивни занятия с други ученици и учител, като могат да споделят идеи, да работят заедно, по групи и да учат по-активно.`,
    text2:
      'От друга страна, частните уроци 1:1 предоставят възможност за персонализирано обучение, където ученикът и учителят работят спрямо индивидуалните нужди на учащия по даден предмет. Този формат на уроци позволява на учениците да получават по-голямо внимание, персонализирани уроци и да се фокусират върху конкретни учебни нужди и цели.',
    text3:
      'От обучения за ниво на езици, математика, литература, наука и други предмети, до специализирани курсове или подготовка за изпити и сертификати, нашата платформа предлага разнообразие от уроци, които могат да задоволят различните интереси и образователни нужди на нашите потребители.',
  },
  {
    header: 'Как да си създам профил на платформата?',
    text: 'За да създадете профил, посетете началната страница на нашата платформа и кликнете върху бутона "Регистрация", намиращ се в горния десен ъгъл. След това изберете опцията за регистрация на потребителски профил. Въведете необходимата информация като потребителско име, електронна поща и парола. След успешната регистрация, ще получите потвърждаващ имейл или съобщение за активация на профила си.\n',
  },
  {
    header: 'Как да намеря подходящ курс/частен урок за моето дете?',
    text: 'За да намерите подходящ курс/частен урок за вашето дете, използвайте търсачката от менютата „Курсове“; „Частни Уроци“. Можете да филтрирате курсовете/частните уроци по предмет, клас и цена. След като намерите желания курс/частен урок, кликнете върху него, за да видите повече информация и да се запишете.',
  },
  {
    header: 'Как да се свържа с учителя на курса?',
    text: 'За да се свържете с преподавателя, влезте в своя акаунт и отидете на страницата на желания/записания от вас курс/частен урок. Оттам под описанието на учителя ще видите бутон „Свържете се с учителя.“',
  },
  {
    header: 'Как да заплащам за уроци на платформата?',
    text: 'За да заплатите за курс/частен урок на нашата платформа, влезте в своя акаунт и изберете желания курс/частен урок. На страницата на курса ще има опция за плащане. Можете да изберете предпочитан метод на плащане и да следвате инструкциите за завършване на транзакцията.',
  },
  {
    header: 'Как мога да се отпиша от курс/частен урок?',
    text: 'За да се отпишете от курс/частен урок, влезте в своя акаунт и отидете в менюто "Моите уроци". Изберете курса/частния урок, от който искате да се отпишете, и на страницата на курса/частния урок ще видите бутон за отписване или прекратяване на участие.',
  },
];

const faqsTeacher = [
  {
    header: 'Как да стана учител на платформата?',
    text: 'За да станете учител на нашата платформа, трябва да създадете учителски профил. За целта, посетете страницата „Стани учител“ на платформата и натиснете бутона "Стани Учител". След това изберете опцията за регистрация като учител и въведете необходимата информация като потребителско име, електронна поща и парола. ',
    text2:
      'След успешната регистрация и преглед на вашата заявка от наша страна, ще получите потвърждение за учителски профил. Тогава ще имате възможност да преминете през нашата верификация и насрочен разговор за верификация от екипа на My Classroom. След което ще получите евентуално потвърждение за активация на вашия профил като учител на My Classroom и ще имате възможност да създавате свои курсове/частни уроци, да преподавате на учениците си и да предоставяте образователни занятия на нашата платформа. ',
  },
  {
    header: 'Трябва ли да съм учител по професия, за да преподавам на платформата?',
    text: 'Не, не е задължително да бъдете учител по професия, за да преподавате на нашата платформа. Ние приветстваме всеки, който е експерт или има специализирани познания в определена област и има желание да преподава. След успешно преминаване на верификацията си, вашите знания и опит в областта ще бъдат проверени и ще можете да преподавате свободно на платформата.',
    text2:
      'Независимо дали сте професионален учител или експерт в дадена област и имате страст към преподавателската дейност, ние ви даваме възможност да създавате и управлявате свои образователни онлайн занятия на платформата.',
  },
  {
    header: 'Трябва ли да плащам месечен абонамент, за да преподавам на платформата?',
    text: 'Не, нашата платформа не изисква от учителите да плащат месечни или годишни абонаменти, за да я използват. Регистрацията за учители е безплатна, като това ви позволява да създавате и предлагате курсове и частни уроци на платформата напълно безплатно.',
  },
];

const HelpCenterAll = () => {
  return (
    <>
      <Center
        w={'100vw'}
        h={'30vh'}
        backgroundImage={helpBackground}
        backgroundSize={'cover'}
        backgroundPosition={{ base: 'center center', xl: 'center center' }}>
        <Heading flex={1} as="h1" fontSize={{ base: 20, lg: 32 }} textAlign="center" pt={16} color={'white'}>
          Как можем да Ви помогнем?
        </Heading>
      </Center>
      <Stack
        spacing={{ base: 8, lg: 10 }}
        pb={{ base: 0, lg: 10 }}
        px={{ base: 8, md: 16, xl: 20, '2xl': 40 }}
        align={'start'}
        justify={'start'}
        flex={1}
        w={'full'}>
        <Center py={{ base: 6, xl: 14 }} pb={20} w={'full'}>
          <Stack p={4} spacing={8} w={'full'}>
            <Heading flex={1} as="h1" fontSize={{ base: 24, lg: 32, xl: 36 }} textAlign="center" pb={8}>
              Често задавани въпроси
            </Heading>

            <Stack bg={'purple.100'} align={'start'} p={2} rounded={'md'}>
              <Text color={'purple.500'} fontWeight={700} pl={6}>
                Ученик/ Родител
              </Text>
            </Stack>

            <Accordion allowToggle>
              <Stack spacing={6}>
                {faqsStudent.map((faq, index) => (
                  <AccordionItem key={index} border={'none'}>
                    {({ isExpanded }) => (
                      <>
                        <h2>
                          <AccordionButton>
                            <Box as="span" flex="1" textAlign="left" fontWeight={600}>
                              {faq.header}
                            </Box>
                            {isExpanded ? <MinusIcon fontSize="12px" /> : <AddIcon fontSize="12px" />}
                          </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign={'left'}>
                          <Text>{faq.text}</Text>
                          {faq?.text2 && (
                            <>
                              {' '}
                              <br /> <Text>{faq?.text2}</Text>{' '}
                            </>
                          )}

                          {faq?.text3 && (
                            <>
                              {' '}
                              <br /> <Text>{faq?.text3}</Text>{' '}
                            </>
                          )}
                        </AccordionPanel>
                      </>
                    )}
                  </AccordionItem>
                ))}
              </Stack>
            </Accordion>

            <Stack bg={'purple.100'} align={'start'} p={2} rounded={'md'}>
              <Text color={'purple.500'} fontWeight={700} pl={6}>
                Учител
              </Text>
            </Stack>

            <Accordion allowToggle>
              <Stack spacing={6}>
                {faqsTeacher.map((faq, index) => (
                  <AccordionItem key={index} border={'none'}>
                    {({ isExpanded }) => (
                      <>
                        <h2>
                          <AccordionButton>
                            <Box as="span" flex="1" textAlign="left" fontWeight={600}>
                              {faq.header}
                            </Box>
                            {isExpanded ? <MinusIcon fontSize="12px" /> : <AddIcon fontSize="12px" />}
                          </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign={'left'}>
                          <Text>{faq.text}</Text>
                          {faq?.text2 && (
                            <>
                              {' '}
                              <br /> <Text>{faq?.text2}</Text>{' '}
                            </>
                          )}

                          {faq?.text3 && (
                            <>
                              {' '}
                              <br /> <Text>{faq?.text3}</Text>{' '}
                            </>
                          )}
                        </AccordionPanel>
                      </>
                    )}
                  </AccordionItem>
                ))}
              </Stack>
            </Accordion>
          </Stack>
        </Center>
      </Stack>
    </>
  );
};

export default HelpCenterAll;
