import React from 'react';
import {
  Box,
  Heading,
  Stack,
  Text,
  Center,
  Accordion,
  AccordionItem,
  AccordionButton,
  AccordionPanel,
} from '@chakra-ui/react';
import { AddIcon, MinusIcon } from '@chakra-ui/icons';
import { helpBackground } from '../../images';

const faqs = [
  {
    header: 'Как да създам курс?',
    text: `От началната страница отивате на меню <b>Моите курсове -> Създай курс </b>. Добавете заглавие, предмет, клас и описание на курса. След което добавете темите на всяко едно от занятията (часовете) в курса Ви, като натиснете моливчето срещу всяка една от темите за добавяне на заглавие и описание на темата. След това добавете дължина на курса, максимален брой на учениците, можещи да се запишат в курса Ви и цена на курса. `,
    text2:
      'От бутона „Добавяне на дата“ можете да добавите датите вече за изготвения от вас курс, а именно от кога до кога да се провежда той. Изберете продължителността (колко седмици да е) и началната дата на курса. Крайната дата ще бъде пресметната автоматично, в зависимост от продължителнността на курса, която сте задали от миналата страница. След това изберете в кои дни от седмицата ще провеждате курса и в кой часов диапазон през деня. Натиснете бутона „Запази“ за да добавите желаните от Вас дати за провеждане на курса.',
    text3:
      'След като добавите дата за Вашия курс, ще можете да публикувате курса Ви като натиснете бутона „Публикувай“ или да го запазите като чернова като натиснете бутона „Запази като чернова“ ',
  },
  {
    header: 'Как да създам частен урок?',
    text: 'От началната страница отивате на меню <b>Моите частни уроци -> Създай урок</b>. Добавете заглавие, предмет, клас и описание на урока. След това добавете дължина и цена на урока Ви. Като последна стъпка изберете дата на провеждане на частния урок и в кой часови диапазон през деня ще се провежда той. След като натиснете бутона „Запази“ се запазват избраните от Вас дата/дати и час/часове за провеждане на Вашия частен урок. ',
    text2:
      'След като сте добавили дати и часове за Вашия урок, ще можете да публикувате урока Ви като натиснете бутона „Публикувай“ или да го запазите като чернова като натиснете бутона „Запази като чернова“.',
  },
  {
    header: 'Какво означава да запазя урок / курс като чернова?',
    text: 'Като запазите Вашия урок / курс като чернова той не е активен и не се вижда от учащите на платформата. Той е видим само и единствено за Вас до момента в който не го публикувате чрез бутона „Публикувай.“\n',
  },
  {
    header: 'Как мога да редактирам информацията в мой курс / урок.',
    text: 'Можете да редактирате Ваш курс / урок като отидете на меню Моите Курсове / Моите частни уроци. След което изберете курса / урока който искате да редактирате и отидете на „Информация“ на курса / урока. Горе в дясно ще видите бутон редактирай,  след като го натиснете ще бъдете отведени на информацията за вашия курс / урок. След като нанесете редакцията си скролнете най - долу и натиснете бутона „Запази промените“ за да може редакцията Ви да бъде запаметена в курса / урока.',
  },
  {
    header: 'Как мога да видя дали имам записани учащи в курса/урока ми?',
    text: 'След като отидете на меню моите курсове / уроци и изберете желания курс / урок ще видите веднага на „Дати“ под всяка една дата броя на записалите се ученици за Вашия курс / урок.',
  },
  {
    header: 'Какво са „Отзиви“ на курс / урок?',
    text: 'Всеки един записал се ученик за Ваш курс / урок може да оцени Вашия курс / урок посредством рейтинг и коментар. Отзивите не могат да бъдат изтрити или скрити от Вас.',
  },
  {
    header: 'Какво виждам в меню „Календар“?',
    text: 'В меню „Календар“ можете да видите под всяка една дата създадените от Вас курсове / уроци.',
  },
];

const HelpCenterTeacher = () => {
  return (
    <>
      <Center
        w={'100vw'}
        h={'30vh'}
        backgroundImage={helpBackground}
        backgroundSize={'cover'}
        backgroundPosition={{ base: 'center center', xl: 'center center' }}>
        <Heading flex={1} as="h1" fontSize={{ base: 20, lg: 32 }} textAlign="center" pt={16} color={'white'}>
          Как можем да Ви помогнем?
        </Heading>
      </Center>
      <Stack
        spacing={{ base: 8, lg: 10 }}
        pb={{ base: 0, lg: 10 }}
        px={{ base: 8, md: 16, xl: 20, '2xl': 40 }}
        align={'start'}
        justify={'start'}
        flex={1}
        w={'full'}>
        <Center py={{ base: 6, xl: 14 }} pb={20} w={'full'}>
          <Stack p={4} spacing={8} w={'full'}>
            <Heading flex={1} as="h1" fontSize={{ base: 24, lg: 32, xl: 36 }} textAlign="center" pb={8}>
              Учителски помощен център
            </Heading>

            <Accordion allowToggle>
              <Stack spacing={6}>
                {faqs.map((faq, index) => (
                  <AccordionItem key={index} border={'none'}>
                    {({ isExpanded }) => (
                      <>
                        <h2>
                          <AccordionButton>
                            <Box as="span" flex="1" textAlign="left" fontWeight={600}>
                              {faq.header}
                            </Box>
                            {isExpanded ? <MinusIcon fontSize="12px" /> : <AddIcon fontSize="12px" />}
                          </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign={'left'}>
                          <Text dangerouslySetInnerHTML={{ __html: faq.text }}></Text>
                          {faq?.text2 && (
                            <>
                              {' '}
                              <br /> <Text>{faq?.text2}</Text>{' '}
                            </>
                          )}

                          {faq?.text3 && (
                            <>
                              {' '}
                              <br /> <Text>{faq?.text3}</Text>{' '}
                            </>
                          )}
                        </AccordionPanel>
                      </>
                    )}
                  </AccordionItem>
                ))}
              </Stack>
            </Accordion>
          </Stack>
        </Center>
      </Stack>
    </>
  );
};

export default HelpCenterTeacher;
