import React from 'react';
import { Link, ListItem, Stack, UnorderedList } from '@chakra-ui/react';
import { Heading, Text, Container, VStack } from '@chakra-ui/react';
const PersonalDataPage = () => {
  return (
    <Stack
      spacing={20}
      py={{ base: 8, lg: 10 }}
      px={{ base: 8, sm: 16, md: 28, lg: 16, xl: 20, '2xl': 40 }}
      mt={{ base: 24, lg: 40 }}
      justify={'start'}
      flex={1}
      w={'full'}>
      <Container maxW={'full'} w={'full'}>
        <Heading as="h1">Политика за Лични Данни</Heading>

        <VStack paddingTop="40px" spacing="4" align="start" textAlign={'start'}>
          <Text as="p" fontSize="lg">
            Тази политика за личните данни определя основата, на която MyClassroom може да събира, използва или
            обработва личната информация на потребителите на нашите услуги, включително учители, ученици и родители или
            законни настойници на непълнолетни ученици.
          </Text>
          <Text as="p" fontSize="lg">
            Администратор на твоите лични данни е „МЕТА-ЯНКОВ“ ЕООД, ЕИК 206788029, с адрес на управление гр.София,
            Младост 1 бл.65 вх.3 ап.69, представлявано от управителя Даниел Янков.
          </Text>

          <Text as="p" fontSize="lg">
            Тази политика за личните данни се придържа към Общ регламент относно защитата на данните (ЕС) 2016/679 на
            Европейския парламент и на Съвета, пприет от 27.04.2016г.
          </Text>

          <Text as="p" fontSize="lg">
            Чрез достъп и използване на нашите услуги, съдържание в социалните мрежи, уебсайта myclassroom.bg или
            посредством контакт с нас чрез имейл или контакт формата ни, вие потвърждавате, че сте прочели и разбрали
            условията на тази политика за личните данни и се съгласявате да събираме, използваме, и/или обработваме
            вашата лична информация за целите, описани тук. Ако не сте съгласни със събирането, използването и/или
            обработването на вашата лична информация за целите, описани тук, включително личната информация на вашия
            непълнолетен подопечен или дете, както е описано в тази Политика за личните данни, можете, когато е
            приложимо, да откажете събирането на определени информация, като изберете подходящите настройки на вашия
            браузър или устройство (когато се събират чрез бисквитки или подобни средства), или да прекратите
            използването на услугите или съдържанието.
          </Text>

          <Text as="p" fontSize="lg">
            Тази Политика за личните данни се отнася за лична информация, която притежаваме, но не и данни, включително
            обобщени или статистически данни, които не са лична информация. Тази Политика за личните данни не се отнася
            за личната информация на нашите служители, директори, собственици или кандидати.
          </Text>

          <Text as="p" fontSize="lg">
            <b>„Лични данни“</b> означава всяка информация, свързана с идентифицирано или идентифицируемо живо физическо
            лице.
          </Text>

          <Text as="p" fontSize="lg">
            <b>Уеб сайтове на трети страни</b>
          </Text>

          <Text as="p" fontSize="lg">
            Сайтът може да съдържа връзки към други уеб сайтове, които не се управляват или контролират от нас („Сайтове
            на трети страни“). Политиките и процедурите, които описахме тук, не се отнасят за сайтове на трети страни.
            Връзките от сайта не означават, че подкрепяме или сме прегледали сайтовете на тези трети страни. Предлагаме
            да се свържете директно с тези сайтове за информация относно техните политики за лични данни.
          </Text>

          <Text as="p" fontSize="lg">
            <b>1. КАТЕГОРИИТЕ ЛИЧНА ИНФОРМАЦИЯ, КОИТО СЪБИРАМЕ ЗА ВАС</b>
          </Text>

          <UnorderedList>
            <ListItem>
              Идентификатори, например: истинско име, телефонен номер, имейл адрес, дата на раждане и снимки.
            </ListItem>
            <ListItem>
              Търговска информация, например: история на закупени продукти или услуги (включително класове), история на
              закупуване и потребление (напр. видове посещавани курсове, интереси към определени теми).
            </ListItem>
            <ListItem>
              Информация за интернет активността, например: взаимодействия с нашия интернет уеб сайт, включително
              хронология на сърфирането и хронология на търсенията, данни за устройството, информация за браузъра,
              характеристики на операционната система, доставчик на интернет услуги и IP адрес.
            </ListItem>
            <ListItem>
              Финансова информация, например: информация за плащане на продукти, услуги и класове, като информация за
              банкови сметки и подписи.
            </ListItem>
            <ListItem>
              Сензорни данни или данни за наблюдение, например: гласови съобщения, записи, видео или аудио във връзка с
              всякакви класове на живо или на запис.
            </ListItem>
            <ListItem>
              Потребителско съдържание, например: Ние събираме данните, които изпращате, когато създавате акаунт,
              свързвате се с съпорта на клиенти или по друг начин се свързвате с нас. Това може да включва обратна
              връзка, снимки или записи, които може да създадете, включително аудио или видео записи, които изпращате
              във връзка с съпорта на клиенти (Помощния център или контак формата за съпорт).
            </ListItem>
            <ListItem>
              Демографски данни, например: Може да събираме демографски данни за вас, включително чрез проучвания,
              например пол и държава на местоживеене.
            </ListItem>
            <ListItem>
              Комуникационни данни, например: По време на нашите комуникации с вас ние събираме съдържанието на тези
              комуникации, както и метаданни за комуникациите, например: дата и час на обаждането и телефонни номера.
            </ListItem>
            <ListItem>
              Изводи, например: Можем да направим заключения за вас от друга лична информация, която събираме. Например,
              бихме могли да заключим въз основа на вашия избор или преподаване на определени класове, че може да се
              интересувате от допълнителни класове с подобен предмет.
            </ListItem>
          </UnorderedList>

          <Text as="p" fontSize="lg">
            Можем да събираме националност и пол за учители, доколкото учителите ни предоставят информация в тази
            връзка.
          </Text>

          <Text as="p" fontSize="lg">
            <b>Повече за разплащателните данни на потребителите:</b>
          </Text>

          <Text as="p" fontSize="lg">
            Въпреки че можете да подадете информация за кредитна карта или друга разплащателна карта, за да платите за
            Услуги през нашия сайт, ние не получаваме сама разплащателна информация. Информацията се предава директно на
            процесори за разплащателни карти на трета страна чрез интернет връзка, защитена от стандартната технология
            за криптиране на транспортния слой (TLS). След това процесорът ни съобщава дали плащането ви е успешно, но
            не ни предоставя информация за платежната карта.
          </Text>

          <Text as="p" fontSize="lg">
            <b>Използваме ли бисквитки?</b>
          </Text>

          <Text as="p" fontSize="lg">
            Да „Бисквитките“ са част от информация, които уебсайтът myclassroom.bg събира. Бисквитките позволяват на
            уебсайта да запомни важна информация, която ще направи използването на уебсайта по-удобно. Например, може да
            използваме бисквитки, за да следим вашите предпочитания и избори, да следим артикулите във вашата количка за
            пазаруване и да ви помогнем да персонализирате вашето уеб изживяване. В тези случаи може да използваме
            събраната информация чрез „Бисквитките“.
          </Text>

          <Text as="p" fontSize="lg">
            Можете да откажете използването на бисквитки, като изберете подходящата настройка на вашия браузър или
            устройство. Използвайте настройките във вашия уеб браузър, ако не желаете да получавате бисквитка или ако
            искате да настроите браузъра си да ви уведомява, когато получите бисквитка. Кликнете върху секцията „Помощ“
            на вашия браузър, за да научите как да промените предпочитанията си за бисквитки. Ако деактивирате всички
            бисквитки, вашият опит и пълната функционалност на услугите може да бъдат засегнати.
          </Text>

          <Text as="p" fontSize="lg">
            Може също така чрез бисквитки или други подобни технологии автоматично да събираме информация като вашия IP
            адрес, местоположение, мрежа, устройство, мобилна операционна система, браузър и хронология на сърфиране.
            Такава информация ще бъде използвана за работа, поддръжка, предоставяне и управление на сайта и предоставяне
            на техническа поддръжка, ако е необходимо.
          </Text>

          <Text as="p" fontSize="lg">
            <b>Google Analytics.</b>
          </Text>

          <Text as="p" fontSize="lg">
            Използваме бисквитки, предоставени от Google Analytics, доставчик на услуги от трета страна, за да ни
            помогнат да разберем по-добре посетителите на нашия сайт. Тези бисквитки събират данни като
            продължителността на времето, което потребителят прекарва на дадена страница, страниците, които потребителят
            посещава, и уебсайтовете, които потребителят посещава преди и след посещението на сайта. Въз основа на тази
            информация Google Analytics обобщава данни за трафика на сайта и интеракции със сайта, които използваме, за
            да предложим по-добро преживяване на нашата платформа в бъдеще на нашите потребители. Google Analytics не
            събира лична информация. За повече информация относно Google Analytics посетете {''}
            <Link href={'https://support.google.com/analytics.'} isExternal color={'blue.400'}>
              https://support.google.com/analytics.
            </Link>
          </Text>

          <Text as="p" fontSize="lg">
            2. КАТЕГОРИИ ИЗТОЧНИЦИ, ОТ КОИТО СЪБИРАМЕ ВАШАТА ЛИЧНА ИНФОРМАЦИЯ
          </Text>

          <UnorderedList>
            <ListItem>
              Учители: Може да получим лична информация за учениците от учители, например оценки на напредъка.
            </ListItem>
            <ListItem>
              Ученици: Може да получим лична информация за учители от ученици, например прегледи на учители.
            </ListItem>
            <ListItem>
              Автоматизирани технологии: Ние също събираме информация за интернет активността чрез автоматизирани
              технологии на сайта, например бисквитки, както е описано по-горе.
            </ListItem>
            <ListItem>
              Технологии за запис: MyClassroom също може да събира лична информация за вас от технологии за гласова поща
              и технологии за аудио/видео запис със съгласие до степента, изисквана от закона, например когато се
              свързвате с отдела за поддръжка на клиенти или предоставяте обратна връзка.
            </ListItem>
            <ListItem>
              Социални мрежи и други рекламни/маркетингови кампании: MyClassroom може, например, да събира лична
              информация от социалните мрежи, ако влезете в нашия сайт чрез вашия акаунт в социалнa мрежа.
            </ListItem>
          </UnorderedList>

          <Text as="p" fontSize="lg">
            3. ЦЕЛИТЕ, ЗА КОИТО ИЗПОЛЗВАМЕ ВАШАТА ЛИЧНА ИНФОРМАЦИЯ
          </Text>

          <Text as="p" fontSize="lg">
            a) Всички потребители
          </Text>

          <Text as="p" fontSize="lg">
            <b>Предоставяне на услуги и съдържание:</b>
          </Text>

          <UnorderedList>
            <ListItem>
              Предоставяне и подобряване на Услугите, включително, предоставяне на видео, гласови или чат функции във
              връзка с всякакви уроци и записи на уроци за по-късен преглед.
            </ListItem>
            <ListItem>
              Обработка, обработване и поддържане на записи на всякакви поръчки, плащания или транзакции (включително
              кредитни транзакции), направени от вас.
            </ListItem>
            <ListItem>
              Потвърждаване на вашата самоличност, регистриране и поддържане на вашия акаунт (ако е приложимо),
              управление на предпочитанията ви за акаунта, включително когато регистрирате акаунт и използвате услугите
              ни, използвайки онлайн услуги на трети страни, включително социални медии и мрежови услуги като Facebook.
            </ListItem>
            <ListItem>Общуване с вас.</ListItem>
            <ListItem>
              Изпълнение на задължения в хода на или във връзка предоставяне на услугите или всякакви продукти и/или
              услуги, поискани от вас.
            </ListItem>
            <ListItem>Позволяване на комуникация и взаимодействие между потребители.</ListItem>
          </UnorderedList>

          <Text as="p" fontSize="lg">
            <b>Поддръжка и маркетинг:</b>
          </Text>

          <UnorderedList>
            <ListItem>
              Отговаряне на всякакви искания, запитвания, предложения, обратна връзка или коментари, които може да
              имате.
            </ListItem>
            <ListItem>
              Когато сте се съгласили да получавате такава информация, да ви изпращаме маркетингова информация за
              услугите, включително да ви уведомяваме за нашите маркетингови събития, инициативи, награди и промоции.
            </ListItem>
            <ListItem>
              Информиране за всички промени в нашите услуги, вашия акаунт (ако е приложимо), тази Политика за личните
              данни или всякакви други политики, или условия във връзка с тях.
            </ListItem>
            <ListItem>За нашата поддръжка на клиенти, правни и архивни цели.</ListItem>
            <ListItem>
              За да гарантираме, че съдържанието и услугите са представени по най-ефективния начин за вас и за вашия
              компютър или друго устройство, от което имате достъп до уебсайта.
            </ListItem>
            <ListItem>
              За да подобрим или модифицираме услугите ни, например въз основа на вашата обратна връзка и начина, по
              който използвате нашите услуги.
            </ListItem>
            <ListItem>
              За извършване на операции за поддържане на съдържанието и услугите ни, включително за извършване на анализ
              на данни, тестване, проучване и анализ на тенденциите, във вашата дейност на платформата
            </ListItem>
          </UnorderedList>

          <Text as="p" fontSize="lg">
            <b>Мониторинг, сигурност и съответствие:</b>
          </Text>

          <UnorderedList>
            <ListItem>
              Защита на услугите ни от заплахи за сигурността (включително до заплахи за нашата ИТ инфраструктура).
            </ListItem>
            <ListItem>
              Съхраняване, хостване, архивиране (независимо дали за възстановяване след бедствие или по друг начин) на
              услугите ни или всякакви данни, съдържащи се в тях.
            </ListItem>
            <ListItem>
              За да улесним техническото функциониране на нашите услуги, включително за отстраняване на неизправности и
              разрешаване на проблеми, защита на съдържанието и/или услугите и предотвратяване на измами и злоупотреби.
            </ListItem>
            <ListItem>За да наблюдаваме спазването на нашите политики.</ListItem>
            <ListItem>За защита на правата, собствеността или безопасността на MyClassroom, вас или други.</ListItem>
            <ListItem>
              Да съобщава на правоприлагащите органи за предполагаемо престъпно поведение и да сътрудничи при
              разследванията.
            </ListItem>
            <ListItem>
              Спазване на всички приложими закони, разпоредби, кодекси на практика, насоки или правила, или за
              подпомагане на правоприлагането и разследванията, провеждани от който и да е правителствен и/или
              регулаторен орган.
            </ListItem>
            <ListItem>
              За да упражним правата си съгласно приложимото законодателство и да подкрепим всеки иск, защита или
              декларация по дело или пред юрисдикционен и/или административен орган, арбитраж или панел за медиация.
            </ListItem>
          </UnorderedList>

          <Text as="p" fontSize="lg">
            b) Студенти и родители или законни настойници на непълнолетни ученици
          </Text>

          <Text as="p" fontSize="lg">
            <b>Предоставяне на услуги и съдържание:</b>
          </Text>

          <Text as="p" fontSize="lg">
            Предоставяне на информация за вашия напредък в курсове, нови услуги, нови функции, промоции и други налични
            курсове.
          </Text>

          <Text as="p" fontSize="lg">
            c) Учители
          </Text>

          <Text as="p" fontSize="lg">
            <b>Предоставяне на услуги и съдържание:</b>
          </Text>

          <Text as="p" fontSize="lg">
            Проверка на вашия опит, квалификации, пълномощия, опит (включително образование, обучение, набор от знания и
            умения) и лицензите, сертификатите и разрешенията, които сте получили за преподаване и предлагане на
            Услугите.
          </Text>

          <Text as="p" fontSize="lg">
            За да изпълняваме задълженията си, произтичащи от всякакви договори между вас и нас.
          </Text>

          <Text as="p" fontSize="lg">
            <b> Случайни цели:</b>
          </Text>

          <Text as="p" fontSize="lg">
            Всички случайни цели, свързани с или във връзка с горепосоченото
          </Text>

          <Text as="p" fontSize="lg">
            4. КАК МОЖЕМ ДА РАЗКРИЕМ ВАШАТА ЛИЧНА ИНФОРМАЦИЯ
          </Text>
          <Text as="p" fontSize="lg">
            <Text as="p" fontSize="lg">
              Като цяло поддържаме поверителността на вашата лична информация. Възможно е обаче да имаме законна бизнес
              необходимост да разкрием вашата лична информация за една от целите, изброени в раздел 3 по-горе, на една
              или повече от категориите външни получатели, изброени по-долу.
            </Text>
          </Text>
          <UnorderedList>
            <ListItem>
              Учители: Учителите могат да получат потребителското име на ученик преди началото на курса. Учителите
              получават допълнителна лична информация за учениците директно от ученика, доколкото ученикът я предоставя.
            </ListItem>
            <ListItem>
              Ученици и студенти: Ние споделяме част от личната информация на учителите с ученици (и родители или
              законни настойници на непълнолетни ученици), за да им помогнем да изберат курсове и учители.
            </ListItem>
            <ListItem>
              Потребители на сайта: Споделяме профили на учители с потребители на сайта. Това включва профила,
              публикуван от учителя, например име, „описание на профила“, идентификационни данни и т.н., както и
              информацията за курса, предоставена от учителя. Профилът включва и отзиви за учителя от студенти.
            </ListItem>
            <ListItem>
              Доставчици: Ние споделяме вашата лична информация с нашите доставчици на услуги трети страни, агенти и
              други организации (включително, без ограничение, всяко плащане, сетълмент, кредитна карта, мрежа,
              компютър, софтуер, обработка на данни или други доставчици на услуги), за целите за предоставяне на
              услугите и изпълнение на задължения ни в хода на или във връзка с предоставянето на услугите от наша
              страна.
            </ListItem>
            <ListItem>
              Изисквани разкривания: Може да се наложи да разкрием лична информация в съдебно производство, в отговор на
              съдебно разпореждане, призовка, искане за гражданско разкриване, друг правен процес или както се изисква
              по друг начин от приложим закон или разпоредби (включително всеки кодекс, правила или насоки за
              изброяване) на всяка съответна юрисдикция.
            </ListItem>

            <ListItem>
              Законово съответствие и защита: Можем да разкрием лична информация, когато смятаме, че разкриването е
              необходимо за спазване на закона или за защита на правата, собствеността или безопасността на MyClassroom,
              вас или други.
            </ListItem>
            <ListItem>
              Корпоративни транзакции: Можем да разкрием вашата лична информация във връзка с корпоративно сливане,
              консолидация, фалит, продажбата на всички или по същество всички наши дeлови участия и/или активи или
              друга корпоративна промяна, включително на потенциални купувачи.
            </ListItem>
          </UnorderedList>

          <Text as="p" fontSize="lg">
            <b>Без продажба на лична информация:</b>
          </Text>

          <Text as="p" fontSize="lg">
            Ние не продаваме вашата лична информация.
          </Text>

          <Text as="p" fontSize="lg">
            5. КАК ЗАЩИТАВАМЕ ВАШАТА ЛИЧНА ИНФОРМАЦИЯ
          </Text>

          <Text as="p" fontSize="lg">
            За да защитим вашата лична информация от неоторизиран достъп, събиране, използване, разкриване, копиране,
            модифициране, изхвърляне или подобни рискове, ние въведохме подходящи административни, физически и
            технически мерки като актуална антивирусна защита, криптиране и използване на филтри за поверителност, за да
            осигурим цялото съхранение и предаване на лична информация от наша страна и разкриване на лична информация
            както вътрешно, така и на нашите упълномощени доставчици на услуги и агенти трети страни само при
            необходимост да се знае. Трябва да сте наясно обаче, че нито един метод за предаване през интернет или метод
            за електронно съхранение не е напълно сигурен. Въпреки че сигурността не може да бъде гарантирана, ние се
            стремим да защитим сигурността на вашата информация и непрекъснато преглеждаме и подобряваме нашите мерки за
            сигурност на информацията.
          </Text>

          <Text as="p" fontSize="lg">
            6. ПРОМЕНИ В НАШАТА ПОЛИТИКА ЗА ЛИЧНИТЕ ДАННИ
          </Text>

          <Text as="p" fontSize="lg">
            При направени промени в нашата политика за личните данни, ще публикуваме актуализирания текст тук и ще
            посочим датата на последната актуализация. Ако промените са важни и съществено изменят практиките ни за
            защита на твоите лични данни, ще те уведомим посредством други средства, например по имейл или чрез
            публикуване на уведомление на нашия уеб сайт и/или страниците ни в социалните медии, преди да влязат в сила
            промените. Последната актуализация на тази политика за личните данни е от януари 2024
          </Text>

          <Text as="p" fontSize="lg">
            Тази политика за личните данни не се отнася за приложения, продукти, услуги, уеб сайтове или функции на
            социални медии на трети страни, до които се осъществява достъп през връзки, предоставяни чрез нашия уебсайт
            за твое удобство. Съветваме те да се запознаеш с политиката за личните данни на всеки сайт, в който влизаш,
            преди да позволиш събиране на твоите лични данни.
          </Text>
        </VStack>
      </Container>
    </Stack>
  );
};

export default PersonalDataPage;
