import React from 'react';
import { Stack } from '@chakra-ui/react';
import { Heading, Text, Container, VStack } from '@chakra-ui/react';
const TermsOfUsePage = () => {
  return (
    <Stack
      spacing={20}
      py={{ base: 8, lg: 10 }}
      px={{ base: 8, sm: 16, md: 28, lg: 16, xl: 20, '2xl': 40 }}
      mt={{ base: 24, lg: 40 }}
      justify={'start'}
      flex={1}
      w={'full'}>
      <Container maxW={'full'} w={'full'}>
        <Heading as="h1">Условия на ползване</Heading>

        <VStack paddingTop="40px" spacing="4" align="start" textAlign={'start'}>
          <Text as="p" fontSize="lg">
            Посещавайки, получавайки достъп, регистрирайки се и/или закупувайки продукти или услуги (включително достъп
            до някой курс/частен урок), Вие се съгласявате да бъдете обвързани с настоящите условия на ползване на
            платформата MyClassroom.
          </Text>
          <Text as="p" fontSize="lg">
            Ако не сте съгласни с тези условия, не можете да използвате или да имате достъп до услугите на платформата.
          </Text>
          <Text as="p" fontSize="lg">
            Запазваме си правото да променяме или модифицираме настоящите условия по всяко време. В случай, че
            предприемем промени по условията на ползване, ще Ви уведомим чрез имейл или по друг разумен начин. Ще се
            счита, че сте се съгласили с изменените условия, ако продължите да използвате и да имате достъп до услугите
            след датата, на която Ви е изпратено уведомление за изменените условия на ползване.
          </Text>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              1. Общи условия
            </Text>

            <Text as="p" fontSize="lg">
              Трябва да сте навършили 13 години, за да използвате услугите на платформата; въпреки това непълнолетни
              лица от всички възрасти могат да използват услугите ни, ако това е разрешено от родител или законен
              настойник.
            </Text>

            <Text as="p" fontSize="lg">
              Ако се считате за непълнолетен (под 18 години), Вие заявявате, че имате съгласието на Вашия родител или
              настойник да използвате услугите на платформата. Моля, помолете ги да прочетат настоящите условия на
              ползване заедно с Вас.
            </Text>

            <Text as="p" fontSize="lg">
              Ако сте родител или законен настойник на малолетно или непълнолетно лице, като разрешавате на детето си да
              използва услугите на платформата и да има достъп до тях, Вие се съгласявате автоматично с настоящите
              условия на ползване и носите отговорност за дейността на вашето дете или подопечен във връзка с услугите
              ни и за спазването на настоящите условия.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              2. Използване на услугите на платформата
            </Text>

            <Text as="p" fontSize="lg">
              При условие че спазвате настоящите условия на ползване, ние ви предоставяме ограничено, отменяемо (със или
              без причина), непрехвърляемо и неподлежащо на сублицензиране право и лиценз за използване и достъп до
              услугите само за ваши лични, нетърговски и образователни цели.
            </Text>

            <Text as="p" fontSize="lg">
              Вие трябва да използвате услугите на платформата в съответствие с приложимите закони и настоящите ни
              условия и не трябва да:
            </Text>

            <Text as="p" fontSize="lg">
              (а) предавате, качвате, публикувате или показвате снимки, видеоклипове, аудио, изображения, съобщения,
              коментари, данни, текст, връзки, документи или информация (&quot;Съдържание&quot;Zzz), включително като
              част от урок (дефиниран по-долу) в хода на комуникацията си с други потребители, които нарушават правата
              на друга страна, включително, без ограничение, правата на публичност, неприкосновеност на личния живот,
              авторски права, търговски марки, права на интелектуална собственост или права по отношение на
              поверителността;
            </Text>

            <Text as="p" fontSize="lg">
              (б) възпроизвеждате, разпространявате, предавате, излъчвате, отдавате под наем, споделяте, давате назаем,
              променяте, адаптирате, редактирате, създавате производни произведения, предоставяте сублиценз или
              прехвърляте по друг начин всеки частен урок/курс (включително всяко съдържание в него), закупен и/или
              достъпен от Вас;
            </Text>

            <Text as="p" fontSize="lg">
              (в) копирате, декомпилирате, разработвате по обратен път, разглобявате, опитвате се да извлечете изходния
              код, декриптирате, намесвате се или нарушавате целостта на услугите на платформата;
            </Text>

            <Text as="p" fontSize="lg">
              (г) да правите каквато и да е промяна, адаптация, подобрение, усъвършенстване, превод или производно
              произведение на или от услугите ни или който и да е частен урок/курс (включително всяко съдържание в
              него);
            </Text>

            <Text as="p" fontSize="lg">
              (д) нарушавате всички приложими закони, правила или разпоредби (включително наказателни закони) във връзка
              с вашия достъп или използване на услугите ни и всеки курс/частен урок (включително всяко съдържание в
              него), закупени или достъпни от Вас;
            </Text>

            <Text as="p" fontSize="lg">
              (е) да премахвате, променяте или скривате всички известия за собственост (включително всички известия за
              авторски права и търговски марки) на MyClassroom;
            </Text>

            <Text as="p" fontSize="lg">
              (ж) използвате услугите ни или всеки курс/частен урок (включително всяко съдържание в него), закупен или
              достъпен от Вас, за търговски цели или за цели, различни от предвидените в настоящите ни условия;
            </Text>

            <Text as="p" fontSize="lg">
              (з) да използвате услугите ни или който и да е курс/частен урок (включително каквото и да е съдържание в
              него), закупен или достъпен от Вас по какъвто и да е начин, за да създавате или популяризирате продукт,
              услуга или софтуер, който пряко или косвено се конкурира или по някакъв начин замества услугите ни, този
              курс/частен урок и/или съдържание или която и да е услуга, продукт или софтуер, предлагани от MyClassroom;
            </Text>
            <Text as="p" fontSize="lg">
              (и) да използвате каквато и да е патентована информация, интерфейси или компоненти (включително какъвто и
              да е код или визуални компоненти) или каквато и да е друга интелектуална собственост на MyClassroom при
              проектирането, разработването, производството, лицензирането или разпространението на каквито и да е
              приложения, аксесоари или устройства;
            </Text>
            <Text as="p" fontSize="lg">
              (й) използвате услугите ни, за да изпращате, публикувате или съобщавате по друг начин каквото и да е
              съдържание, което е обидно, неприлично, заплашително, оскърбително, оскърбително, тормозещо,
              клеветническо, подвеждащо, измамно, неправомерно, неприлично, нецензурно, нарушаващо личния живот на друго
              лице, расово или етнически неприемливо и/или в нарушение на приложимите закони;
            </Text>
            <Text as="p" fontSize="lg">
              (к) да използвате услугите на платформата за изпращане на автоматизирани, непоискани или неразрешени
              съобщения, рекламни или промоционални материали или каквато и да е нежелана поща, спам или верижни писма,
              включително чрез която и да е комуникационна услуга или услуга за изпращане на съобщения;
            </Text>
            <Text as="p" fontSize="lg">
              (л) да качвате или предавате чрез услугите ни данни, файлове, софтуер, връзки или Съдържание, които
              съдържат или пренасочват към вирус, троянски кон, червей или други вредни компоненти;
            </Text>
            <Text as="p" fontSize="lg">
              (м) използвате скрепер, робот, бот, паяк, обхождащ компютър или друго автоматизирано устройство или
              средство за достъп, придобиване, копиране, наблюдение, използване или работа с която и да е част от
              услугите на платформата, курс/частен урок или съдържанието, или с каквито и да е данни или съдържание,
              намерени или достъпни чрез платформата;
            </Text>
            <Text as="p" fontSize="lg">
              (н) да събирате каквато и да е информация по отношение на други потребители в нарушение на законите за
              защита на личните данни или правата, свързани с неприкосновеността на личния живот;
            </Text>
            <Text as="p" fontSize="lg">
              (о) да извършите каквото и да е действие, за да избегне плащането на приложимите такси и/или налози или да
              заобиколи каквито и да е ограничения или платени стени;
            </Text>
            <Text as="p" fontSize="lg">
              (п) да се опитвате и/или да участвате в каквато и да е дейност или действие, което има за цел да
              злоупотреби, да злоупотребява или да манипулира по неподходящ начин каквато и да е промоция, кампания
              и/или промоционални кодове, предлагани чрез услугите ни. Такива действия и дейности включват, но не се
              ограничават до: създаване на фалшиви или дублиращи се акаунти; генериране на фалшиви поръчки; купуване и
              препродаване на собствени услуги;
            </Text>
            <Text as="p" fontSize="lg">
              (р) разрешавате или насърчавате когото и да било да извърши някое от горепосочените действия.{' '}
            </Text>
            <Text as="p" fontSize="lg">
              Запазваме си правото по свое усмотрение да ограничим, спрем или прекратим използването или достъпа на
              даден потребител до услугите на платформата или до който и да е курс/частен урок или съдържание по каквато
              и да е причина по всяко време, включително, но не само, за нарушаване на приложимите закони или настоящите
              ни условия на ползване.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              3. Акаунт
            </Text>

            <Text as="p" fontSize="lg">
              Ще ви е необходим акаунт, за да използвате или да имате достъп до някои от услугите, включително за да
              имате достъп и/или да закупите достъп до курс/частен урок.
            </Text>

            <Text as="p" fontSize="lg">
              При създаването и поддържането на Вашия акаунт трябва да предоставите и да продължите да предоставяте
              точна и пълна информация, включително валиден имейл адрес и номер за контакт (ако е приложимо).
            </Text>

            <Text as="p" fontSize="lg">
              Вие носите отговорност за всички дейности и транзакции в рамките на вашия профил. Ние няма да носим
              никаква отговорност, ако Вашият акаунт и/или парола бъдат присвоени или използвани от трета страна.
              Съгласявате се да пазите паролата си и да не споделяте данните си за вход с друго лице.
            </Text>

            <Text as="p" fontSize="lg">
              Освен ако не е изрично разрешено от нас, нямате право да създавате няколко акаунта. Нямате право да
              прехвърляте, да давате под наем или да продавате своя акаунт на друго лице или да използвате акаунта на
              друг потребител.
            </Text>

            <Text as="p" fontSize="lg">
              Ако се свържете с нас, за да поискате достъп до даден профил, ние няма да ви предоставим такъв достъп,
              освен ако не можете да ни предоставите информация, доказваща, че сте собственик на този профил. В случай
              на смърт на потребител профилът на този потребител ще бъде закрит.
            </Text>

            <Text as="p" fontSize="lg">
              Трябва незабавно да ни уведомите за всяко неоторизирано използване (или ако подозирате друго нарушение на
              сигурността) на вашия акаунт, като се свържете с нас, като използвате нашите данни за контакт по-долу.
              Можем да поискаме информация от Вас, за да потвърдим, че наистина сте собственик на Вашия акаунт.
            </Text>

            <Text as="p" fontSize="lg">
              За да създадете профил, трябва да сте навършили поне 18 години. Ако не сте навършили 18 години, не можете
              да създавате акаунт, но можете да поканите родител или настойник да открие акаунт и да Ви помогне да
              използвате, да получите достъп и/или да закупите достъп до подходящия за Вас курс/частен урок. Ако
              открием, че сте създали акаунт, който нарушава тези правила, ще прекратим Вашия акаунт.
            </Text>

            <Text as="p" fontSize="lg">
              Съгласно нашите условия за учители от Вас може да бъде поискано да потвърдите самоличността си, преди да
              Ви бъде разрешено да предоставяте услуги за учители чрез Вашия акаунт за учители или да предоставяте
              курс/частен урок или съдържание за продажба, показване и публикуване в услугите на платформата.
            </Text>

            <Text as="p" fontSize="lg">
              Запазваме си правото по наше усмотрение да ограничаваме, спираме или прекратяваме използването на даден
              акаунт, включително акаунт на учител, по каквато и да е причина по всяко време, включително, но не само,
              за нарушаване на приложимите закони или настоящите условия на платформата.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              4. Курс/частен урок
            </Text>

            <Text as="p" fontSize="lg">
              Като част от Услугите можете да закупите достъп до онлайн сесии на живо, предоставяни от учители, заедно с
              всяко качено от тях съдържание, като закупите достъп до съответния частен урок/курс през платформата.
            </Text>

            <Text as="p" fontSize="lg">
              Такова занятие ще бъде предоставено по такъв предмет, за такава продължителност, по такъв график и с такъв
              минимален и/или максимален брой обучаеми, както е посочено в описанието на занятието. Потребителите, които
              закупуват достъп до даден курс/частен урок, трябва да заплатят предварително за него или текущи
              абонаментни такси .
            </Text>

            <Text as="p" fontSize="lg">
              Занятие в курс/частен урок се счита за присъствено, ако започне в съответствие с планираните дата и час,
              освен в случаите, когато занятието е пренасрочено, отмененоо или не е завършен от преподавателя.
            </Text>

            <Text as="p" fontSize="lg">
              Ние или учителят можем да променим графика или да отменим даден курс/частен урок или сесия по всяко време
              по наша преценка. В случай на такова пренасрочване ще положим разумни търговски усилия, за да уведомим за
              това преди началната дата на курсч/частния урок или сесията.
            </Text>

            <Text as="p" fontSize="lg">
              Сесиите могат да бъдат автоматично записвани с цел предоставяне на такива сесии на учащите, които са
              пропуснали или желаят да прегледат сесията, за преглед от страна на учителя и от наша страна с цел
              подобряване на Услугите и/или курса/частния урок, и за целите на нашата поддръжка на клиенти, правни цели
              и водене на документация. Такива Сесии, ако бъдат записани, ще се съхраняват на нашите сървъри за максимум
              три 3 месеца, след което тези записи ще бъдат изтрити.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              5. Плащания
            </Text>

            <Text as="p" fontSize="lg">
              В зависимост от частния урок/курса, който сте закупили и до който имате достъп, както и от допълнителните
              услуги, които можете да поискате във връзка с използването или достъпа до услугите на платформата (ако има
              такива), ще ви бъдат начислени еднократни или текущи абонаментни такси за закупения от вас курс/частен
              урок, както и всички такси, ако има такива, за допълнителни продукти или услуги извън посочения
              курс/частен урок.
            </Text>

            <Text as="p" fontSize="lg">
              Вие се съгласявате да заплатите таксите за всеки курс/частен урок или продукти или услуги, закупени от
              Вас, и ни упълномощавате да начислим такса от Вашата кредитна карта, дебитна карта или друг метод на
              плащане, предоставен в момента на покупката. Съгласявате се да поддържате актуални Вашия акаунт и друга
              информация, включително Вашия имейл адрес и номер за контакт, за да можем да се свържем с Вас при
              необходимост.
            </Text>

            <Text as="p" fontSize="lg">
              Когато извършвате покупка, се съгласявате да използвате валиден метод за плащане. Ако плащането Ви се
              окаже неуспешно и получите достъп до курса/частния урок (включително до всяко съдържание в него), който
              сте закупили, Вие се съгласявате да ни заплатите съответните такси в рамките на пет 5 дни от уведомяването
              от наша страна. Запазваме си правото да забраним достъпа до всеки курс/частен урок или съдържание, за
              които не сме получили съответното плащане.
            </Text>

            <Text as="p" fontSize="lg">
              Цената, приложима за закупения от Вас курс/частен урок или продукти или услуги, ще бъде цената в момента
              на завършване на покупката, както е посочена при checkout. Всички такси се заплащат във валутата, посочена
              при checkout по време на покупката.
            </Text>

            <Text as="p" fontSize="lg">
              Запазваме си правото по наша преценка да забраним, ограничим, отменим всяка поръчка, която сте направили
              при нас, по каквато и да е причина, включително, но не само, всяко действително или предполагаемо
              нарушение на приложимите закони или настоящите ни условия. В случай че ограничим или отменим поръчка, може
              да се опитаме да ви уведомим, като се свържем с електронната поща и/или адреса/телефона за фактуриране,
              предоставени в момента на извършване на поръчката. Запазваме си правото да забраняваме, ограничаваме или
              отменяме поръчки, които по наша преценка изглеждат като направени от дилъри, прекупвачи или дистрибутори.
            </Text>

            <Text as="p" fontSize="lg">
              Възможно е от време на време да предлагаме промоционални кодове или кодове за отстъпки или карти за
              подаръци. Тези кодове или карти за подаръци и всички кредити, които са ви предоставени, ако има такива,
              могат да изтекат, ако не бъдат използвани в рамките на срока на валидност на тези кодове, карти за
              подаръци или предоставен кредит (включително датата, на която тези кодове, карти за подаръци или кредит са
              били предоставени) или на предвидения период, посочен в нашите услуги или във вашия акаунт, и не могат да
              бъдат възстановени в брой.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              6. Потребителско съдържание
            </Text>

            <Text as="p" fontSize="lg">
              В качеството си на потребител, който не е учител (&quot;обучаем&quot;), можете да стриймвате, качвате,
              публикувате или показвате съдържание при използването и достъпа си до усугите ни и комуникацията с други
              потребители, включително учители, ако е приложимо. Вие разбирате и се съгласявате, че носите пълната
              отговорност за съдържанието, което стриймвате, качвате, публикувате или показвате в или чрез услугите на
              платформата. Ние не носим отговорност за нарушения или загуби или щети, които сте претърпели в резултат на
              стрийминг, качване, публикуване или показване на такова съдържание.
            </Text>

            <Text as="p" fontSize="lg">
              Вие запазвате правата си на собственост върху съдържанието, което публикувате, споделяте, предавате,
              качвате или показвате, но предоставяте на MyClassroom напълно платен, безвъзмезден, сублицензируем и
              прехвърляем лиценз за хостване, съхраняване, използване, показване, възпроизвеждане, модифициране,
              адаптиране, редактиране, публикуване и разпространение на това съдържание (при спазване на политиката за
              личните данни) с цел разработване, популяризиране и подобряване на услугите на платформата, както и за
              проучване и разработване на нови продукти и услуги.
            </Text>

            <Text as="p" fontSize="lg">
              Вие потвърждавате, че MyClassroom не извършва предварителен контрол на съдържанието, качено от Вас или
              други обучаеми. MyClassroom има правото (но не и задължението) по свое усмотрение да отказва, изтрива,
              премахва или ограничава достъпа до всяко съдържание, включително това на преподаватели, достъпно в
              услугите на платформата. MyClassroom има право да премахне каквото и да е съдържание, без да носи
              отговорност или задължение да предлага възстановяване на средства, в някой от следните случаи:
            </Text>

            <Text as="p" fontSize="lg">
              (а)ако съдържанието е в нарушение на приложимите закони или на настоящите условия;
            </Text>

            <Text as="p" fontSize="lg">
              (б)ако MyClassroom е получило жалба или уведомление за нарушение по отношение на съдържанието;
            </Text>

            <Text as="p" fontSize="lg">
              Ако закупите достъп до някой курс/частен урок в съответствие с Клауза 5 (Плащания), ние ви предоставяме,
              при спазване на настоящите ни условия, ограничен, отменяем (със или без причина), непрехвърляем,
              непубликуем лиценз за достъп и разглеждане на курса/частния урок и всяко съдържание в него единствено за
              ваши лични, нетърговски и образователни цели за срока на вашия курс/частен урок в съответствие с
              настоящите ни условия.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              7. Отказ от отговорност
            </Text>

            <Text as="p" fontSize="lg">
              Вие потвърждавате и се съгласявате, че Вашият достъп и използване на услугите ни (включително всички
              акаунти или акаунти на учители), всеки курс/частен урок или съдържанието и всяка информация или материали
              в тях се предоставят на принципа &quot;както е&quot; и &quot;както са налични&quot;. По-специално, Вие
              потвърждавате и се съгласявате, че MyClassroom може да установи практики и ограничения относно
              използването на определена услуга, включително, максималния период от време, за който всяко съдържание ще
              бъде запазено от услугата, и че Вашето използване, достъп до услугите ни, всеки курс/частен урок,
              съдържание, продукти или услуги, до които имате достъп или които сте получили по този начин, е единствено
              на Ваш риск и по Ваша преценка.
            </Text>

            <Text as="p" fontSize="lg">
              В максималната степен, позволена от закона, нито едно от MyClassroom или неговите дружества-майки, дъщерни
              дружества, филиали, директори, служители, представители, агенти, служители или изпълнители не прави
              никакви изявления или дава гаранции от какъвто и да е вид, независимо дали са изрични, законови или
              подразбиращи се, че, Вашият акаунт или акаунт на учител, всеки курс/частен урок или съдържание, всяка
              информация или материали в тях или Вашето използване или достъп до тях:
            </Text>

            <Text as="p" fontSize="lg">
              (а) е или ще бъде сигурна, навременна, непрекъсната, налична, запазена или съхранявана в услугата или без
              грешки, дефекти, неточности, пропуски или злонамерен софтуер (включително когато такива въпроси произтичат
              от използването на хардуер, софтуер, система, устройство, мрежа или данни), или че такива въпроси ще бъдат
              коригирани;
            </Text>

            <Text as="p" fontSize="lg">
              (б) е или ще бъде съвместимо или оперативно съвместимо с какъвто и да е хардуер, софтуер, система,
              устройство, мрежа или данни, или няма да причини загуба или повреда на какъвто и да е хардуер, софтуер,
              система, устройство, мрежа или данни;
            </Text>

            <Text as="p" fontSize="lg">
              (в) е или ще бъде продаваемо, подходящо за конкретна учебна програма, курс на обучение или цел, или ще
              отговаря на вашите изисквания или очаквания или на изискванията на трета страна;
            </Text>

            <Text as="p" fontSize="lg">
              (г) е или ще бъде точно, пълно, актуално или налично в услугите на платформата по всяко време;
            </Text>

            <Text as="p" fontSize="lg">
              (д) не нарушава и няма да наруши права на трети страни.
            </Text>

            <Text as="p" fontSize="lg">
              От време на време услугите ни могат да съдържат инструменти, плъгини или услуги на трети страни,
              предоставяни от нашите дружества-майки, дъщерни дружества и/или филиали (&quot;Партньорски услуги&quot;).
              Възможно е от време на време и по наша преценка да изискваме от Вас да се съгласите и да потвърдите
              допълнителни условия, свързани с тези партньорски услуги.
            </Text>

            <Text as="p" fontSize="lg">
              Никаква информация или материали, независимо дали устни или писмени, получени от MyClassroom, услугите или
              който и да е курс/частен урок или съдържание, не създават никакви гаранции.
            </Text>
            <Text as="p" fontSize="lg">
              Услугите, които използвате, Вашият акаунт или акаунт на учител, всеки курс/частен урок или съдържание, или
              Вашето използване или достъп до тях могат да бъдат обект на ограничения, забавяния и други проблеми,
              присъщи на използването на интернет и електронните комуникации (включително проблеми, присъщи на мрежата,
              устройството или софтуера, които използвате). MyClassroom не носи отговорност за забавяния, неуспешни
              доставки, щети или загуби, произтичащи от такива проблеми или от събития извън нашия разумен контрол,
              включително, всякакви военни действия, враждебност, саботаж, природни бедствия, прекъсване на
              електрозахранването, интернет или телекомуникациите или правителствени ограничения. Също така не носим
              отговорност за съхраняването или запазването на каквото и да е съдържание, качено от вас на или в
              използваните от вас услуги, за което трябва да поддържате собствени резервни копия от време на време.
            </Text>
            <Text as="p" fontSize="lg">
              Вие се съгласявате, че от време на време можем да преустановим част или всичките ни услуги или
              използването или достъпа до който и да е курс/частен урок или съдържание за неопределен период от време
              (включително, в съответствие с настоящите условия или с цел надграждане или поддръжка на услугите ни) или
              да отменим използваните от Вас услуги по всяко време, без да Ви уведомяваме или да носим отговорност.
            </Text>

            <Text as="p" fontSize="lg">
              Вие потвърждавате и се съгласявате, че нашата отговорност към Вас за предоставянето на услугите ни е
              ограничена до предоставянето от наша страна на курсовете/частните уроци или съдържанието чрез услугите
              само за срока на закупения от Вас курс/частен урок (по отношение на учащите) и че ние не правим никакви
              изявления или гаранции по отношение на използването на услугите ни от който и да е друг потребител
              (включително учителите) или на съдържанието, излъчвано, качвано, публикувано или показвано от тях в
              опеделените услуги.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              8. Ограничаване на отговорността
            </Text>

            <Text as="p" fontSize="lg">
              MyClassroom, нейните компании-майки, дъщерни дружества, филиали, директори, служители, представители,
              агенти, служители, изпълнители, партньори, доставчици на услуги, лицензодатели и техните съответни
              наследници и/или правоприемници няма да носят отговорност, в максималната степен, позволена от закона, за
              каквито и да било наранявания, загуби, искове или каквито и да било косвени, случайни, наказателни,
              специални или последващи щети от какъвто и да било вид, включително, пропуснати ползи, пропуснати приходи,
              пропуснати спестявания, загуба на данни, загуба на хардуер, разходи за подмяна или други подобни щети,
              независимо дали се основават на договор, деликт (включително небрежност) или друго, произтичащи от Вашия
              достъп или използване на всички или част от услугите на платформата, Вашия акаунт или акаунт на учител,
              или който и да е курс/частен урок или съдържание, което и да е съдържание, предавано, качвано, публикувано
              или показвано в услугите ни, който и да е продукт, услуга или функционалност, до които имате достъп, които
              използвате или получавате в тях, което и да е поведение на потребителите в услугите ни или за какъвто и да
              е иск, свързан с горепосоченото, включително, но не само, за всякакви грешки или пропуски или каквато и да
              е информация или материал в тях, или за всякакви загуби или щети от какъвто и да е вид, възникнали в
              резултат на Вашия достъп или използване на услугите ни, частния урок/курса или съдържанието, дори ако сме
              били уведомени за възможността.
            </Text>

            <Text as="p" fontSize="lg">
              Независимо от горното в тази клауза, максималната обща отговорност на MyClassroom и гореспоменатите лица
              към вас, независимо дали е по договор, деликт (включително небрежност) или по друг начин, произтичаща от
              или във връзка с настоящите условия, услугите, вашия акаунт или акаунт на учител, всеки курс/частен урок
              или съдържание или всяка информация или материал в тях, или вашето използване или достъп до тях, не
              надвишава общата стойност на вашите покупки в рамките на услугите.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              9. Връзки с трети страни
            </Text>

            <Text as="p" fontSize="lg">
              Услугите, курсът/частният урок или съдържанието може да съдържат връзки към други уебсайтове или
              приложения. MyClassroom не носи отговорност за проверка или оценка на съдържанието, пълнотата, точността
              или наличността на тези уебсайтове или приложения на трети страни и ние не гарантираме и не носим
              отговорност за такива уебсайтове или приложения на трети страни или за каквато и да е информация,
              материали, продукти или услуги на трети страни.
            </Text>

            <Text as="p" fontSize="lg">
              Ние не носим отговорност за каквито и да било вреди или щети, свързани с покупката или използването на
              стоки, услуги, ресурси, информация, материали, съдържание или други транзакции или дейности, извършени във
              връзка с уебсайтове или приложения на трети страни. Моля, прегледайте внимателно правилата и практиките на
              третата страна и се уверете, че ги разбирате, преди да се ангажирате с каквато и да е дейност или
              транзакция. Оплаквания, претенции, притеснения или въпроси относно уебсайтове, приложения, информация,
              материали, продукти или услуги на трети страни трябва да се отправят към третата страна.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              10. Обезщетение
            </Text>

            <Text as="p" fontSize="lg">
              Вие ще обезщетите и ще предпазите MyClassroom, нейните компании-майки, дъщерни дружества, филиали,
              директори, служители, представители, агенти, служители, изпълнители, партньори, доставчици на услуги,
              лицензодатели и техните съответни наследници и/или правоприемници от и срещу всички искове, претенции,
              производства, щети, загуби, разходи и разноски (включително разумни правни и професионални такси),
              произтичащи от или във връзка с (а) използването на услугите ни или използването или достъпа до който и да
              е курс/частен урок (включително всяко съдържание в него); (б) Вашето съдържание; (в) използването на Вашия
              акаунт; (г) Вашето нарушение на настоящите условия; или (д) Вашето нарушение на приложимите закони или
              разпоредби (включително, без ограничение, всички закони за защита на данните) или нарушаване на правата на
              друго лице или организация във връзка с горепосоченото.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              11. Прекратяване
            </Text>

            <Text as="p" fontSize="lg">
              Тези условия са в сила, освен ако и докато не бъдат прекратени от вас или от нас. Можете да прекратите
              настоящите условия по всяко време, като деактивирате акаунта си, ако е възможно чрез настройките на
              акаунта ви, или ни уведомите, че не желаете повече да използвате нашите услуги.
            </Text>

            <Text as="p" fontSize="lg">
              Ние си запазваме правото по наше усмотрение и без отговорност или възстановяване на средства:
            </Text>

            <Text as="p" fontSize="lg">
              (a) да спрем или прекратим вашия акаунт и/или достъпа ви до услугите по всяко време по каквато и да е
              причина без предварително уведомление, включително, без ограничение, за всяко нарушение на настоящите
              условия или всякакви допълнителни правила и условия и политики, споменати тук; или
            </Text>

            <Text as="p" fontSize="lg">
              (b) да променим, модифицираме, спрем или прекратим, независимо дали временно или окончателно, цялата или
              част от услугите по всяко време, по каквато и да е причина и без предварително известие.
            </Text>

            <Text as="p" fontSize="lg">
              Вие потвърждавате и се съгласявате, че ако деактивирате акаунта си или ако спрем или прекратим акаунта ви,
              съществуващият ви курс/частен урок ще бъде анулиран и, ако е приложимо, възстановен в съответствие с
              настоящите условия и ще загубите всякаква информация или използване или достъп до който и да е курс/частен
              урок или съдържание, свързано с вашия акаунт. Ние няма да носим отговорност за загуба или загуба на достъп
              до който и да е курс/частен урок или съдържание от Ваша страна или от което и да е друго лице.
            </Text>

            <Text as="p" fontSize="lg">
              При прекратяване всички лицензи и права, предоставени ви в настоящите условия, незабавно ще бъдат
              прекратени. Всички права или задължения, поети от нас или от вас преди прекратяването, остават в сила след
              прекратяването на тези условия между нас и вас за всички цели.
            </Text>

            <Text as="p" fontSize="lg">
              Клаузи 6 (по отношение на Съдържание, качено от вас), 7, 8, 9, 10, 11, 12, 13 и 14 остават в сила след
              прекратяването на тези условия.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              12. Поверителност
            </Text>

            <Text as="p" fontSize="lg">
              Събирането, използването и/или разкриването на каквито и да е лични данни, предоставени от вас или събрани
              в хода на вашето използване и достъп до услугите ни или който и да е курс/частен урок или съдържание, ще
              се урежда от Политиката за лични данни.
            </Text>
          </VStack>

          <VStack spacing={2} align={'start'}>
            <Text as="p" fontSize="lg">
              13. Разни
            </Text>

            <Text as="p" fontSize="lg">
              Нищо в настоящите условия няма за цел или не трябва да се счита за установяване на взаимоотношения между
              MyClassroom и вас като представителство, партньорство, съвместно предприятие, служител-работодател или
              франчайзодател-франчайзополучател.
            </Text>

            <Text as="p" fontSize="lg">
              Ако някоя разпоредба или част от разпоредбата на тези условия е или стане невалидна, незаконна или
              неприложима, такава разпоредба или част от разпоредба ще се счита за променена до минималната степен,
              необходима, за да бъде валидна, законна и изпълнима. Ако такава промяна не е възможна, съответната
              разпоредба или част от разпоредбата се считат за изтрити. Всяко изменение или изтриване на разпоредба или
              част от разпоредба съгласно тази клауза няма да повлияе на валидността и изпълнимостта на останалата част
              от настоящите условия.
            </Text>

            <Text as="p" fontSize="lg">
              Освен както е посочено тук, всеки неуспех от страна на MyClassroom да упражни право или да изиска
              изпълнение на задължение в настоящите условия няма да повлияе на способността на MyClassroom да упражнява
              това право или да изисква такова изпълнение по всяко време след това, нито отказът от нарушение на
              настоящите условия представлява отказ от всяко последващо нарушение.
            </Text>

            <Text as="p" fontSize="lg">
              Вие нямате право да възлагате права или да делегирате каквито и да е задължения тук без нашето
              предварително писмено съгласие. Ние можем да прехвърлим нашите права или да делегираме каквито и да е
              задължения тук без вашето предварително писмено съгласие.
            </Text>

            <Text as="p" fontSize="lg">
              Тези условия и всички допълнителни условия или политики, споменати тук или приети или признати от вас при
              използването или достъпа до услугите ни, съставляват цялото споразумение между вас и MyClassroom и
              заместват всички предишни или текущи разбирания, споразумения, декларации или гаранции между вас и
              MyClassroom.
            </Text>
          </VStack>
        </VStack>
      </Container>
    </Stack>
  );
};

export default TermsOfUsePage;
